option1 = [
    # Listening
    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОни говорят",
     "options": ["в магазине", "в автомастерской", "в центре тестирования"],
     "correct": "в центре тестирования", "audio": "audio/img1_1628676924.ogg"},

    {"question": "Прослушайте объявление и выберите правильный ответ.\n\nСпросите о потерянных вещах",
     "options": ["у покупателей", "у администратора", "у директора магазина"],
     "correct": "у администратора", "audio": "audio/img1_1628677158.ogg"},

    # Reading
    {
        "question": "Прочитайте объявление и выберите правильный ответ.\n\nУважаемые жильцы дома №7!\nЛифт временно не работает!",
        "options": ["в аптеке", "в подъезде", "в парке"], "correct": "в подъезде"},
    {
        "question": "Прочитайте текст и выберите правильный ответ.\n\nДорогой друг!\nПриглашаю тебя на мой День рождения!\nПраздник будет 19 ноября (в четверг) с 15 до 20 часов.\nЖду тебя в кафе «Уют».",
        "options": ["в 15 часов", "в 19 часов", "в 20 часов"], "correct": "в 15 часов"},

    # Writing
    {
        "question": "Прочитайте текст и вставьте пропущенное слово.\n\nДалер приехал из Таджикистана. Далер – кассир.\n\nВпишите нужное слово в анкету.",
        "options": ["кассир", "врач", "учитель"], "correct": "кассир"},

    # Grammar and Vocabulary
    {"question": "Сегодня четверг, а брат приедет завтра, _____________________.",
     "options": ["в среду", "в пятницу", "в субботу"], "correct": "в пятницу"},
    {"question": "В аптеке я купил __________.", "options": ["телефон", "огурцы", "лекарство"], "correct": "лекарство"},
    {"question": "– Как тебя зовут?\n– _______________ зовут Олег.", "options": ["Мне", "Меня", "Я"],
     "correct": "Меня"},
    {"question": "Мы приехали в Россию, __________ найти работу.", "options": ["чтобы", "поэтому", "потому что"],
     "correct": "чтобы"},

    # History
    {"question": "1 января в России празднуют", "options": ["День России", "Новый год", "Международный женский день"],
     "correct": "Новый год"},
    {"question": "Город, который является столицей России - __________.",
     "options": ["Москва", "Екатеринбург", "Самара"], "correct": "Москва"},
    {"question": "Когда закончилась Великая Отечественная война?",
     "options": ["в 1917 году", "в 1945 году", "в 1980 году"], "correct": "в 1945 году"},
    {"question": "СНГ было образовано после",
     "options": ["распада СССР в 1991 году", "Великой Отечественной войны", "Российской революции 1917 года"],
     "correct": "распада СССР в 1991 году"},
    {"question": "Укажите флаг Российской Федерации.",
     "options": ["Белый-синий-красный", "Красный-зеленый-белый", "Синий-белый-золотой"],
     "correct": "Белый-синий-красный"},

    # Law
    {"question": "Что говорит Конституция России о правах иностранцев в России?",
     "options": ["Иностранцы имеют все права и обязанности как граждане России",
                 "Иностранцы имеют права и обязанности, кроме случаев, установленных законом",
                 "Иностранцы не имеют прав в России"],
     "correct": "Иностранцы имеют права и обязанности, кроме случаев, установленных законом"},
    {"question": "Иностранец, работающий в России, должен платить налоги?", "options": ["должен", "не должен", "может"],
     "correct": "должен"},
    {
        "question": "На территории Российской Федерации в отношении иностранного гражданина совершено преступление. Куда он должен обратиться за помощью?",
        "options": ["в полицию", "в МИД", "в посольство своей страны"], "correct": "в полицию"},
    {"question": "Что нужно иметь иностранцу для постановки на учет в России?",
     "options": ["только миграционную карту", "только паспорт", "паспорт и миграционную карту"],
     "correct": "паспорт и миграционную карту"},
    {"question": "Если иностранец нарушил правила учета, какая будет ответственность?",
     "options": ["дисциплинарная", "уголовная", "административная"], "correct": "административная"},
    {"question": "Административное выдворение из России для иностранцев устанавливает судья. Это верно?",
     "options": ["верно", "неверно"], "correct": "верно"}
]

option2 = [
    # Listening
    {"question": "Прослушайте диалог и определите, где они говорят. Выберите правильный ответ.", "options": ["в продуктовом магазине", "в кассе кинотеатра", "в магазине «Игрушки»"], "correct": "в продуктовом магазине"},
    {"question": "Прослушайте объявление и выберите правильный ответ.", "options": ["ехать дальше", "сделать пересадку", "выйти из вагона"], "correct": "сделать пересадку", "audio": "audio/var2_1.ogg"},

    # Reading
    {"question": "Прочитайте объявление и выберите правильный ответ.\n\nУважаемые пассажиры!\nОплачивайте проезд при входе.", "options": ["в кино", "в автобусе", "в магазине"], "correct": "в автобусе"},
    {"question": "Прочитайте текст и выберите правильный ответ.\n\nМеня зовут Рушан. Летом я ездил в Узбекистан к родителям. Я увидел своего брата и его семью. А в конце лета я с женой и детьми поехал на море.", "options": ["с женой и детьми", "с родителями", "с братом"], "correct": "с женой и детьми", "audio": "audio/var2_2.ogg"},

    # Writing
    {"question": "Прочитайте текст и вставьте пропущенное слово.\n\nМадина приехала из Узбекистана. Мадина – швея.\n\nВпишите нужное слово в анкету.", "options": ["Таджикистана", "России", "Узбекистана"], "correct": "Узбекистана"},

    # Grammar and Vocabulary
    {"question": "В магазине «Продукты» я купил _______________.", "options": ["диван", "куртку", "фрукты"], "correct": "фрукты"},
    {"question": "Моя сестра _______________ в больнице.", "options": ["живёт", "гуляет", "работает"], "correct": "работает"},
    {"question": "Сколько _______________ лет?", "options": ["Вы", "Вам", "у Вас"], "correct": "Вам"},
    {"question": "Друг спросил меня: «_______________ ты провёл выходные?»", "options": ["Как", "Какой", "Что"], "correct": "Как"},

    # History
    {"question": "4 ноября в России празднуют", "options": ["Международный женский день", "День народного единства", "День Победы"], "correct": "День народного единства"},
    {"question": "Какой из этих городов находится в России?", "options": ["София", "Владивосток", "Берлин"], "correct": "Владивосток"},
    {"question": "Союзник СССР в Великой Отечественной войне – это:", "options": ["Япония", "Германия", "Великобритания"], "correct": "Великобритания"},
    {"question": "Первый человек, полетевший в космос, был из", "options": ["США", "СССР", "Китая"], "correct": "СССР"},
    {"question": "Укажите флаг Российской Федерации.", "options": ["Белый-синий-красный", "Зеленый-белый-синий", "Красный-синий-белый"], "correct": "Белый-синий-красный"},

    # Law
    {"question": "Какое право Конституция РФ гарантирует иностранцам?", "options": ["голосовать на выборах", "участвовать в суде", "пользоваться родным языком"], "correct": "пользоваться родным языком"},
    {"question": "Где регистрируют брак в России?", "options": ["в суде", "в ЗАГСе", "в полиции"], "correct": "в ЗАГСе"},
    {"question": "Потеряли паспорт. Куда обратиться?", "options": ["в полицию и консульство", "в суд", "на работу"], "correct": "в полицию и консульство"},
    {"question": "Сколько времени дается для постановки на учет в России?", "options": ["3 рабочих дня", "7 рабочих дней", "10 рабочих дней"], "correct": "7 рабочих дней"},
    {"question": "Какой кодекс регулирует правила въезда иностранцев в Россию?", "options": ["Трудовой кодекс", "Кодекс об административных правонарушениях", "Гражданский кодекс"], "correct": "Кодекс об административных правонарушениях"},
    {"question": "Иностранцев с ВИЧ депортируют из России. Это верно?", "options": ["верно", "неверно"], "correct": "верно"}
]

option3 = [
    # Listening
    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОни говорят",
     "options": ["на улице", "на остановке", "в автобусе"],
     "correct": "в автобусе", "audio": "audio/img1_1628676913.ogg"},

    {"question": "Прослушайте объявление и выберите правильный ответ.\n\nУ администратора магазина можно",
     "options": ["взять свой потерянный телефон", "купить новый телефон", "позвонить по телефону"],
     "correct": "взять свой потерянный телефон", "audio": "audio/img1_1628677261.ogg"},

    # Reading
    {"question": "Прочитайте киноафишу и выберите правильный ответ.\n\nОсенью смотрите фильм о русском музыканте П.И. Чайковском!", "options": ["о спорте", "о музыке", "о кино"], "correct": "о музыке"},
    {"question": "Прочитайте текст и выберите правильный ответ.\n\nМеня зовут Тимур. Вчера я со своими друзьями ходил на концерт. Концерт был в парке. Нам очень понравилось. После концерта мы решили поужинать в кафе.", "options": ["на концерте", "в музее", "в театре"], "correct": "на концерте"},

    # Writing
    {"question": "Прочитайте текст и вставьте пропущенное слово.\n\nНариман приехал из Узбекистана. Нариман – врач.\n\nВпишите нужное слово в анкету.", "options": ["учитель", "кассир", "врач"], "correct": "врач"},

    # Grammar and Vocabulary
    {"question": "А.С. Пушкин родился летом, _______________.", "options": ["6 июня", "6 апреля", "6 декабря"], "correct": "6 июня"},
    {"question": "Мой папа любит _______________ исторические книги.", "options": ["смотреть", "слушать", "читать"], "correct": "читать"},
    {"question": "Ты знаешь, _______________ есть брат и сестра?", "options": ["он", "ему", "у него"], "correct": "у него"},
    {"question": "Я не могу сегодня пойти на работу, _______________ я заболел.", "options": ["чтобы", "потому что", "который"], "correct": "потому что"},

    # History
    {"question": "12 июня в России празднуют", "options": ["День России", "Праздник Весны и Труда", "День защитника Отечества"], "correct": "День России"},
    {"question": "Какой город в России называют «второй столицей»?", "options": ["Екатеринбург", "Владивосток", "Санкт-Петербург"], "correct": "Санкт-Петербург"},
    {"question": "Противник России в Отечественной войне 1812 года был:", "options": ["Швеция", "Великобритания", "Франция"], "correct": "Франция"},
    {"question": "Знаменитый полководец Великой Отечественной войны – это", "options": ["А.В. Суворов", "Г.К. Жуков", "Ю.А. Гагарин"], "correct": "Г.К. Жуков"},
    {"question": "Укажите флаг Российской Федерации.", "options": ["Белый-синий-красный", "Зеленый-белый-синий", "Красный-синий-белый"], "correct": "Белый-синий-красный"},

    # Law
    {"question": "Какое право иностранцу гарантирует Конституция России?", "options": ["голосовать на выборах", "выбирать работу", "занимать государственные должности"], "correct": "выбирать работу"},
    {"question": "В какой форме заключается трудовой договор в России?", "options": ["в письменной", "в устной", "в любой"], "correct": "в письменной"},
    {"question": "Окажут ли срочную медицинскую помощь иностранцу?", "options": ["за плату", "бесплатно", "если есть трудовой договор"], "correct": "бесплатно"},
    {"question": "Какую цель нужно указать в миграционной карте для получения патента?", "options": ["отдых", "работа", "частная"], "correct": "работа"},
    {"question": "Сколько дней у иностранца для подачи документов на патент?", "options": ["30 дней", "20 дней", "10 дней"], "correct": "30 дней"},
    {"question": "Если иностранец не уехал после окончания срока пребывания, он нарушает закон. Это верно?", "options": ["верно", "неверно"], "correct": "верно"}
]

option4 = [
    # Listening
    {"question": "Прослушайте диалог и выберите правильный ответ.\n\nЧто сделал Антон?",
     "options": ["Он не дал мобильный телефон.", "Он потерял мобильный телефон.", "Он дал мобильный телефон"],
     "correct": "Он дал мобильный телефон", "audio": "audio/img1_1630321154.ogg"},

    {"question": "Прослушайте объявление и выберите правильный ответ.\n\nВ торговом центре можно пообедать",
     "options": ["на 6 этаже", "на 5 этаже", "на 3 этаже"],
     "correct": "на 5 этаже", "audio": "audio/img1_1700821507.ogg"},

    # Reading
    {"question": "Прочитайте объявление и выберите правильный ответ.\n\nСлужебное помещение: вход только для персонала!", "options": ["в лифте", "в ресторане", "в автобусе"], "correct": "в ресторане"},
    {"question": "Прочитайте текст и выберите правильный ответ.\n\nМеня зовут Динара. Я приехала с родителями из Таджикистана. Мой папа инженер, а мама учительница. В будущем я хочу быть доктором.", "options": ["доктором", "учительницей", "инженером"], "correct": "доктором"},

    # Writing
    {"question": "Прочитайте текст и вставьте пропущенное слово.\n\nАнвар Рустамов хочет получить работу плотника.\n\nВпишите нужное слово в его заявление.", "options": ["плотника", "инженера", "учителя"], "correct": "плотника"},

    # Grammar and Vocabulary
    {"question": "Я с друзьями поеду в горы _____________.", "options": ["зимой", "зимний", "зима"], "correct": "зимой"},
    {"question": "Скажите, пожалуйста, ___________ уже закончили?", "options": ["работа", "рабочие", "работать"], "correct": "работать"},
    {"question": "– Откуда ты приехал?\n– Я приехал _______________.", "options": ["в Самарканде", "из Самарканда", "в Самарканд"], "correct": "из Самарканда"},
    {"question": "Карим сказал, _______________ он приедет в отпуск весной.", "options": ["что", "потому что", "куда"], "correct": "что"},

    # History
    {"question": "7 января в России празднуют", "options": ["День России", "Международный женский день", "Рождество Христово"], "correct": "Рождество Христово"},
    {"question": "Какой из этих городов российский?", "options": ["Будапешт", "Казань", "Братислава"], "correct": "Казань"},
    {"question": "Кто командовал русской армией в войне 1812 года?", "options": ["Г.К. Жуков", "Дмитрий Донской", "М.И. Кутузов"], "correct": "М.И. Кутузов"},
    {"question": "Когда было создано СНГ?", "options": ["в 1612 году", "в 1941 году", "в 1991 году"], "correct": "в 1991 году"},
    {"question": "Укажите герб Российской Федерации.", "options": ["Двуглавый орёл", "Трехцветный щит", "Парусный корабль"], "correct": "Двуглавый орёл"},

    # Law
    {"question": "Что имеет право делать иностранец в России?", "options": ["быть пилотом гражданского самолета", "работать на объектах, связанных с безопасностью", "говорить на родном языке"], "correct": "говорить на родном языке"},
    {"question": "Как дети иностранцев учатся в России?", "options": ["бесплатно, как и дети граждан России", "только платно", "не имеют права посещать школы и детсады"], "correct": "бесплатно, как и дети граждан России"},
    {"question": "Иностранец может жениться в России?", "options": ["да", "да, только на гражданке РФ", "нет"], "correct": "да"},
    {"question": "Что нужно получить и заполнить при въезде в Россию?", "options": ["заявление на патент", "миграционную карту", "заявление на работу"], "correct": "миграционную карту"},
    {"question": "Какой кодекс регулирует наказание за преступление иностранца в России?", "options": ["Уголовный кодекс России", "Уголовный кодекс страны иностранца", "Гражданский кодекс"], "correct": "Уголовный кодекс России"},
    {"question": "Иностранец, не уехавший из России вовремя, будет депортирован. Это верно?", "options": ["верно", "неверно"], "correct": "верно"}
]

option5 = [
    # Listening
    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОбъявление можно услышать",
     "options": ["в ресторане", "в магазине", "в библиотеке"],
     "correct": "в магазине", "audio": "audio/img1_1630321134.ogg"},
    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОни говорят",
     "options": ["в магазине", "в ресторане", "в кафе"],
     "correct": "в магазине", "audio": "audio/img1_1700819917.ogg"},

    # Reading
    {"question": "Прочитайте объявление и выберите правильный ответ.\n\nТехнический перерыв 15 минут", "options": ["в магазине", "в самолёте", "в парке"], "correct": "в магазине"},
    {"question": "Прочитайте текст и выберите правильный ответ.\n\nСабине сорок три года. Она приехала с семьей из Узбекистана. Дома она работала поваром. Её муж работает таксистом. Сабина планирует работать в школе поваром.", "options": ["таксистом", "поваром", "продавцом"], "correct": "поваром"},

    # Writing
    {"question": "Прочитайте текст и вставьте пропущенное слово.\n\nКарим Исмаилов хочет получить работу повара.\n\nВпишите нужное слово в его заявление.", "options": ["повара", "водителя", "учителя"], "correct": "повара"},

    # Grammar and Vocabulary
    {"question": "– Автобусная остановка находится здесь?\n– Нет, ___________________.", "options": ["там", "оттуда", "куда"], "correct": "там"},
    {"question": "Мой брат работает в ресторане _____________________.", "options": ["учителем", "курьером", "инженером"], "correct": "курьером"},
    {"question": "Извините, это ________ телефон?", "options": ["Ваша", "Ваши", "Ваш"], "correct": "Ваш"},
    {"question": "Скажите, пожалуйста, _________ находится аптека?", "options": ["где", "как", "откуда"], "correct": "где"},

    # History
    {"question": "23 февраля в России празднуют", "options": ["Праздник Весны и Труда", "День защитника Отечества", "День России"], "correct": "День защитника Отечества"},
    {"question": "Какой из этих городов в России?", "options": ["София", "Прага", "Новосибирск"], "correct": "Новосибирск"},
    {"question": "Когда началась Великая Отечественная война?", "options": ["в 1812 году", "в 1917 году", "в 1941 году"], "correct": "в 1941 году"},
    {"question": "Кто участвовал в создании СНГ?", "options": ["Иван Грозный", "Борис Ельцин", "Дмитрий Пожарский"], "correct": "Борис Ельцин"},
    {"question": "Укажите герб Российской Федерации.", "options": ["Двуглавый орёл", "Трехцветный щит", "Парусный корабль"], "correct": "Двуглавый орёл"},

    # Law
    {"question": "Какое право гарантирует Конституция РФ иностранцу?", "options": ["ознакомиться с документами, касающимися его прав", "самостоятельно составлять документы", "вносить изменения в документы"], "correct": "ознакомиться с документами, касающимися его прав"},
    {"question": "Может ли иностранец купить недвижимость в России?", "options": ["может", "не может", "только с разрешения суда"], "correct": "может"},
    {"question": "Куда обратиться, если ограбили?", "options": ["в полицию", "в суд", "на работу"], "correct": "в полицию"},
    {"question": "Если срок пребывания в России сокращен, за сколько дней нужно покинуть страну?", "options": ["90 дней", "30 дней", "3 дня"], "correct": "3 дня"},
    {"question": "Если иностранец нарушил правила учета, какую ответственность он понесет?", "options": ["дисциплинарную", "уголовную", "административную"], "correct": "административную"},
    {"question": "Если иностранец вовремя не подал на патент, его депортируют. Это верно?", "options": ["верно", "неверно"], "correct": "верно"}
]
