
listening = [
    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОни говорят",
     "options": ["в магазине", "в автомастерской", "в центре тестирования"],
     "correct": "в центре тестирования", "audio": "audio/img1_1628676924.ogg"},

    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОни говорят",
     "options": ["на улице", "на остановке", "в автобусе"],
     "correct": "в автобусе", "audio": "audio/img1_1628676913.ogg"},

    {"question": "Прослушайте диалог и определите, где происходит разговор.  Выберите правильный ответ.\n\nОни говорят",
     "options": ["в кинотеатре", "в магазине", "в гостинице"],
     "correct": "в гостинице", "audio": "audio/img1_1628676900.ogg"},

    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОбъявление можно услышать",
     "options": ["в ресторане", "в магазине", "в библиотеке"],
     "correct": "в магазине", "audio": "audio/img1_1630321134.ogg"},

    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОни говорят",
     "options": ["в магазине", "в ресторане", "в кафе"],
     "correct": "в магазине", "audio": "audio/img1_1700819917.ogg"},

    {"question": "Прослушайте объявление и выберите правильный ответ.\n\nСпросите о потерянных вещах",
     "options": ["у покупателей", "у администратора", "у директора магазина"],
     "correct": "у администратора", "audio": "audio/img1_1628677158.ogg"},

    {"question": "Прослушайте объявление и выберите правильный ответ.\n\nУ администратора магазина можно",
     "options": ["взять свой потерянный телефон", "купить новый телефон", "позвонить по телефону"],
     "correct": "взять свой потерянный телефон", "audio": "audio/img1_1628677261.ogg"},

    {"question": "Прослушайте объявление и выберите правильный ответ.\n\nТеперь банк будет работать",
     "options": ["до 9 часов вечера", "как обычно", "до 21 мая"],
     "correct": "до 9 часов вечера", "audio": "audio/img1_1628677287.ogg"},

    {"question": "Прослушайте диалог и выберите правильный ответ.\n\nЧто сделал Антон?",
     "options": ["Он не дал мобильный телефон.", "Он потерял мобильный телефон.", "Он дал мобильный телефон"],
     "correct": "Он дал мобильный телефон", "audio": "audio/img1_1630321154.ogg"},

    {"question": "Прослушайте объявление и выберите правильный ответ.\n\nВ торговом центре можно пообедать",
     "options": ["на 6 этаже", "на 5 этаже", "на 3 этаже"],
     "correct": "на 5 этаже", "audio": "audio/img1_1700821507.ogg"}
]

reading = [
    {"question": "Прочитайте объявление и выберите правильный ответ.\nУважаемые граждане! Оплачивайте свой проезд вовремя! Такое объявление можно прочитать",
     "options": ["в парке", "в автобусе", "в самолёте"], "correct": "в автобусе"},

    {"question": "Прочитайте киноафишу и выберите правильный ответ.\nС 3 марта смотрите фильм о победах российских спортсменов! Новый фильм снят",
     "options": ["о политике", "о спорте", "о музыке"], "correct": "о спорте"},

    {"question": "Прочитайте объявление и выберите правильный ответ.\nОсторожно: опасная зона! Вы можете увидеть это объявление",
     "options": ["в ресторане", "на стройке", "в автобусе"], "correct": "на стройке"},

    {"question": "Прочитайте объявление и выберите правильный ответ.\nМеста для инвалидов, лиц пожилого возраста и пассажиров с детьми. Вы можете увидеть это объявление",
     "options": ["в транспорте", "в театре", "в парке"], "correct": "в транспорте"},

    {"question": "Прочитайте объявление и выберите правильный ответ.\nУважаемые пассажиры! ВЫХОД К ПОЕЗДАМ в конце зала № 1. Такое объявление можно прочитать",
     "options": ["на рынке", "на вокзале", "на почте"], "correct": "на вокзале"},

    {"question": "Прочитайте текст и выберите правильный ответ.\nУважаемые гости! Приглашаем Вас на автобусную экскурсию по городу. Экскурсия будет 12 мая (во вторник) с 10 до 14 часов. Ждём Вас около торгового центра «Мир». Экскурсия начинается",
     "options": ["в 10 часов", "в 12 часов", "в 14 часов"], "correct": "в 10 часов"},

    {"question": "Прочитайте текст и выберите правильный ответ.\nМеня зовут Дамир. Вчера у меня был выходной. Я со своей семьёй хорошо отдохнул. Днём мы были в парке. А вечером решили поужинать дома. Вчера днём Дамир и его семья были",
     "options": ["в парке", "в ресторане", "в театре"], "correct": "в парке"},

    {"question": "Прочитайте текст и выберите правильный ответ.\nМеня зовут Лейла. Сегодня утром мы с сыном ходили на экскурсию по городу. Весь день была хорошая погода. Мы гуляли до самого вечера. Пришли домой поздно. Лейла вернулась домой",
     "options": ["вечером", "днём", "утром"], "correct": "вечером"},

    {"question": "Прочитайте текст и выберите правильный ответ.\nАнвару двадцать лет. Он приехал из Узбекистана. Дома он учился и помогал отцу продавать фрукты на базаре. Его брат работает дворником. Анвар планирует работать на стройке. Он хочет строить дома и школы. Кем будет работать Анвар?",
     "options": ["продавцом", "строителем", "дворником"], "correct": "строителем"},

    {"question": "Прочитайте текст и выберите правильный ответ.\nМеня зовут Юлия. Я работаю в аптеке несколько месяцев. Это трудная, но интересная работа, часто я помогаю выбрать лекарство. Каждому покупателю я говорю: «Будьте здоровы!». Юлия работает в аптеке",
     "options": ["недавно", "много лет", "всю жизнь"], "correct": "недавно"}
]

writing = [
    {
        "question": "Прочитайте текст и впишите пропущенное слово.\nБатыр приехал из Узбекистана. Батыр – строитель.\nВпишите нужное слово в анкету.\nАнкета\n1. Как Вас зовут?\nМеня зовут Батыр. \n2. Откуда Вы приехали?\nЯ приехал из Узбекистана. \n3. Кто Вы по профессии?\nЯ ________________.\n",
        "options": ["строитель", "врач", "учитель"],
        "correct": "строитель"
    },
    {
        "question": "Прочитайте текст и впишите пропущенное слово.\nАнвар приехал из Узбекистана. Анвар – повар.\nВпишите нужное слово в анкету.\nАнкета\n1. Как Вас зовут?\nМеня зовут Анвар. \n2. Откуда Вы приехали?\nЯ приехал из ____________________. \n3. Кто Вы по профессии?\nЯ повар.\n",
        "options": ["Узбекистана", "России", "Казахстана"],
        "correct": "Узбекистана"
    },
    {
        "question": "Прочитайте текст и впишите пропущенное слово.\nАлишер приехал из Узбекистана. Алишер – водитель.\nВпишите нужное слово в анкету.\nАнкета\n1. Как Вас зовут?\nМеня зовут Алишер. \n2. Откуда Вы приехали?\nЯ приехал из Узбекистана. \n3. Кто Вы по профессии?\nЯ _________________________.\n",
        "options": ["водитель", "инженер", "механик"],
        "correct": "водитель"
    },
    {
        "question": "Прочитайте текст и впишите пропущенное слово.\nМуслим Ибрагимов хочет получить работу курьера.\nВпишите нужное слово в его заявление.\nЗаявление\nПрошу принять меня на работу на должность___________________________.\n",
        "options": ["курьера", "менеджера", "водителя"],
        "correct": "курьера"
    },
    {
        "question": "Прочитайте текст и впишите пропущенное слово.\nМухаммад Турдиев со своей женой приехал в Россию. Впишите нужное слово в его анкету.\nАНКЕТА\nВозраст\n30 лет\nСемейное положение\n",
        "options": ["женат", "холост", "разведён"],
        "correct": "женат"
    }
]

questions = [
    {"question": "Сегодня суббота, а мама приехала вчера, _____________________.",
     "options": ["в среду", "в пятницу", "во вторник"], "correct": "в пятницу"},

    {"question": "В магазине «Мебель» я купил _______________.",
     "options": ["Хлеб", "Брюки", "Стол"], "correct": "Стол"},

    {"question": "А.С. Пушкин родился летом, _______________.",
     "options": ["6 июня", "6 сентября", "6 января"], "correct": "6 июня"},

    {"question": "Станция метро находится здесь? – Нет, ___________________.",
     "options": ["Там", "Оттуда", "Куда"], "correct": "Там"},

    {"question": "В магазине «Фрукты и овощи» я купил _____________.",
     "options": ["Конфеты", "Яблоки", "Молоко"], "correct": "Яблоки"},

    {"question": "В салоне сотовой связи я купил __________.",
     "options": ["молоко", "куртку", "телефон"], "correct": "телефон"},

    {"question": "Мой друг _______________ в магазине.",
     "options": ["живёт", "гуляет", "работает"], "correct": "работает"},

    {"question": "Я люблю _______________ хорошую музыку.",
     "options": ["читать", "слушать", "смотреть"], "correct": "слушать"},

    {"question": "Моя сестра работает в больнице _____________________.",
     "options": ["учителем", "врачом", "парикмахером"], "correct": "врачом"},

    {"question": "Вчера мы ______________ в парке.",
     "options": ["отдыхаем", "будем отдыхать", "отдыхали"], "correct": "отдыхали"},

    {"question": "Как вас зовут? – _______________ зовут Иван.",
     "options": ["Мне", "Меня", "Я"], "correct": "Меня"},

    {"question": "Мы приехали в Россию, __________ здесь есть работа.",
     "options": ["потому что", "поэтому", "чтобы"], "correct": "потому что"},

    {"question": "Врач спросил меня: «_______________ вы себя чувствуете?».",
     "options": ["Как", "Какой", "Что"], "correct": "Как"},

    {"question": "Вы не можете работать в России, _______________ не получили разрешение на работу.",
     "options": ["чтобы", "потому что", "который"], "correct": "потому что"},

    {"question": "Скажите, пожалуйста, _________ находится поликлиника?",
     "options": ["где", "как", "откуда"], "correct": "где"},

    {"question": "Ты смотрел, _____________ завтра будет погода?",
     "options": ["какая", "что", "чья"], "correct": "какая"}
]

history_quest = [
    {
        "question": "4 ноября в России празднуют",
        "options": ["Международный женский день", "День народного единства", "День Победы"],
        "correct": "День народного единства"
    },
    {
        "question": "7 января в России празднуют",
        "options": ["День России", "Международный женский день", "Рождество Христово"],
        "correct": "Рождество Христово"
    },
    {
        "question": "23 февраля в России празднуют",
        "options": ["Праздник Весны и Труда", "День защитника Отечества", "День России"],
        "correct": "День защитника Отечества"
    },
    {
        "question": "День Победы в России отмечают",
        "options": ["1 января", "9 мая", "4 ноября"],
        "correct": "9 мая"
    },
    {
        "question": "День России в России отмечают",
        "options": ["23 февраля", "9 мая", "12 июня"],
        "correct": "12 июня"
    },
    {
        "question": "Столица Российской Федерации - __________.",
        "options": ["Москва", "Екатеринбург", "Самара"],
        "correct": "Москва"
    },
    {
        "question": "В Российской Федерации находится город",
        "options": ["София", "Владивосток", "Берлин"],
        "correct": "Владивосток"
    },
    {
        "question": "Какой город Российской Федерации называют \u00abвторой столицей\u00bb России?",
        "options": ["Екатеринбург", "Владивосток", "Санкт-Петербург"],
        "correct": "Санкт-Петербург"
    },
    {
        "question": "Какой из этих городов находится в России?",
        "options": ["София", "Прага", "Новосибирск"],
        "correct": "Новосибирск"
    },
    {
        "question": "В России находится город",
        "options": ["Самара", "Будапешт", "Пекин"],
        "correct": "Самара"
    },
    {
        "question": "Великая Отечественная война закончилась ______________.",
        "options": ["в 1917 г.", "в 1945 г.", "в 1980 г."],
        "correct": "в 1945 г."
    },
    {
        "question": "Союзником СССР в годы Великой Отечественной войны была",
        "options": ["Япония", "Германия", "Великобритания"],
        "correct": "Великобритания"
    },
    {
        "question": "Противником России в Отечественной войне 1812 г. была",
        "options": ["Швеция", "Великобритания", "Франция"],
        "correct": "Франция"
    },
    {
        "question": "Русской армией в ходе Отечественной войны 1812 г. командовал",
        "options": ["Г.К. Жуков", "Дмитрий Донской", "М.И. Кутузов"],
        "correct": "М.И. Кутузов"
    },
    {
        "question": "В 1945 г.",
        "options": ["советские войска взяли Берлин", "состоялся первый в мире полёт человека в космос", "вступил в силу Договор о создании Евразийского экономического союза"],
        "correct": "советские войска взяли Берлин"
    },
    {
        "question": "Содружество Независимых Государств (СНГ) было образовано после",
        "options": ["распада СССР в 1991 г.", "Великой Отечественной войны в 1941–1945 гг.", "Великой российской революции 1917–1922 гг."],
        "correct": "распада СССР в 1991 г."
    },
    {
        "question": "Прославленный полководец Великой Отечественной войны – ___________.",
        "options": ["А.В. Суворов", "Г.К. Жуков", "Ю.А. Гагарин"],
        "correct": "Г.К. Жуков"
    },
    {
        "question": "Содружество Независимых Государств (СНГ) было создано",
        "options": ["в 1612 г.", "в 1941 г.", "в 1991 г."],
        "correct": "в 1991 г."
    },
    {
        "question": "В создании Содружества Независимых Государств (СНГ) участвовал",
        "options": ["Иван Грозный", "Борис Ельцин", "Дмитрий Пожарский"],
        "correct": "Борис Ельцин"
    },
    {
        "question": "В 1961 г. совершил полёт в космос",
        "options": ["Ю.А. Гагарин", "Б.Н. Ельцин", "Г.К. Жуков"],
        "correct": "Ю.А. Гагарин"
    }
]

law_quest = [
    {"question": "Статья 62 Конституции Российской Федерации определяет статус иностранных граждан на территории Российской Федерации. Согласно этой статье",
     "options": ["иностранные граждане пользуются всеми правами и несут обязанности",
                 "иностранные граждане пользуются правами и несут обязанности наравне с гражданами РФ",
                 "иностранные граждане не обладают никакими правами на территории Российской Федерации"],
     "correct": "иностранные граждане пользуются правами и несут обязанности наравне с гражданами РФ"},

    {"question": "Какое право Конституция Российской Федерации гарантирует иностранному гражданину на территории Российской Федерации?",
     "options": ["избирать в органы власти", "участвовать в правосудии", "пользоваться родным языком"],
     "correct": "пользоваться родным языком"},

    {"question": "Какое право Конституция Российской Федерации гарантирует иностранному гражданину на территории Российской Федерации?",
     "options": ["избирать в органы власти", "трудиться, выбирать род занятий", "занимать государственные должности"],
     "correct": "трудиться, выбирать род занятий"},

    {"question": "Иностранный гражданин, проживающий на территории Российской Федерации, имеет право на территории РФ",
     "options": ["быть командиром воздушного судна гражданской авиации", "быть принятым на работу на объекты, связанные с безопасностью РФ", "говорить на родном языке"],
     "correct": "говорить на родном языке"},

    {"question": "Какое право Конституция Российской Федерации гарантирует иностранному гражданину на территории Российской Федерации?",
     "options": ["знакомиться с документами и материалами, затрагивающими его права", "самостоятельно составлять документы", "вносить изменения в документы"],
     "correct": "знакомиться с документами и материалами, затрагивающими его права"},

    {"question": "Где происходит регистрация брака в Российской Федерации?",
     "options": ["в суде", "в отделе ЗАГС", "в полиции"],
     "correct": "в отделе ЗАГС"},

    {"question": "В какой форме согласно Трудовому кодексу РФ заключается трудовой договор?",
     "options": ["только в письменной", "только в устной", "любой"],
     "correct": "только в письменной"},

    {"question": "Имеет ли иностранный гражданин право приобретать недвижимое имущество на территории Российской Федерации?",
     "options": ["имеет", "не имеет", "только с разрешения суда"],
     "correct": "имеет"},

    {"question": "Иностранный гражданин в РФ обязан",
     "options": ["однократно пройти дактилоскопическую регистрацию при получении разрешения на работу",
                 "участвовать в выборах", "уметь ориентироваться на территории субъекта"],
     "correct": "однократно пройти дактилоскопическую регистрацию при получении разрешения на работу"},

    {"question": "Право на медицинскую помощь для иностранных граждан",
     "options": ["не распространяется на детей иностранных граждан",
                 "не распространяется на иностранных пенсионеров",
                 "обеспечивается законодательством РФ"],
     "correct": "обеспечивается законодательством РФ"},

    {"question": "На территории Российской Федерации иностранный гражданин совершил преступление. Куда он должен обратиться за помощью?",
     "options": ["в полицию", "в Министерство иностранных дел РФ", "в посольство своей страны"],
     "correct": "в полицию"},

    {"question": "Вы потеряли паспорт. Куда следует обратиться?",
     "options": ["в полицию и консульство своей страны", "в суд", "в отдел кадров"],
     "correct": "в полицию и консульство своей страны"},

    {"question": "Имеет ли право иностранный гражданин вступить в брак на территории Российской Федерации?",
     "options": ["да", "да, но только с гражданами РФ", "нет"],
     "correct": "да"},

    {"question": "Куда следует обратиться человеку, если его ограбили?",
     "options": ["в полицию", "в суд", "в отдел кадров"],
     "correct": "в полицию"},

    {"question": "Иностранному гражданину исполнилось 18 лет. Может ли он работать в Российской Федерации?",
     "options": ["да", "нет", "да, но после распоряжения"],
     "correct": "да"},

    {"question": "Для постановки на учёт по месту пребывания иностранный гражданин должен иметь",
     "options": ["только миграционную карту", "только паспорт", "паспорт и миграционную карту"],
     "correct": "паспорт и миграционную карту"},

    {"question": "По общему правилу срок постановки иностранного гражданина на учёт составляет",
     "options": ["3 рабочих дня", "7 рабочих дней", "10 рабочих дней"],
     "correct": "7 рабочих дней"},

    {"question": "Какую цель въезда нужно указать в миграционной карте, чтобы получить патент?",
     "options": ["отдых", "работа", "частная"],
     "correct": "работа"},

    {"question": "При въезде в РФ необходимо получить и заполнить",
     "options": ["заявление на патент", "миграционную карту", "заявление на работу"],
     "correct": "миграционную карту"},

    {"question": "Когда должен покинуть территорию Российской Федерации временно пребывающий иностранный гражданин?",
     "options": ["по первому требованию работодателя", "по первому требованию правоохранительных органов", "по истечении срока временного пребывания"],
     "correct": "по истечении срока временного пребывания"},

    {"question": "Если иностранный гражданин нарушил правила постановки на миграционный учёт, то он привлекается к ____________ ответственности",
     "options": ["дисциплинарной", "уголовной", "административной"],
     "correct": "административной"},

    {"question": "Наказание за нарушение иностранным гражданином правил въезда в РФ устанавливает",
     "options": ["Трудовой кодекс", "Кодекс об административных правонарушениях", "Гражданский кодекс"],
     "correct": "Кодекс об административных правонарушениях"},

    {"question": "Для получения патента иностранный гражданин предоставляет документы в течение",
     "options": ["30 дней", "20 дней", "10 дней"],
     "correct": "30 дней"},

    {"question": "Иностранный гражданин совершил преступление на территории РФ. Каким кодексом регулируется ответственность?",
     "options": ["Уголовным кодексом РФ", "Уголовным кодексом страны его гражданства", "Гражданским кодексом РФ"],
     "correct": "Уголовным кодексом РФ"},

    {"question": "Если иностранный гражданин нарушил правила постановки на учёт, то он привлекается к ответственности",
     "options": ["дисциплинарной", "уголовной", "административной"],
     "correct": "административной"},

    {"question": "Административное выдворение за пределы РФ как мера административного наказания назначается судьёй. Верно ли это?",
     "options": ["верно", "неверно"],
     "correct": "неверно"},

    {"question": "Иностранный гражданин, уклоняющийся от выезда из РФ, несёт ответственность по законодательству РФ. Верно ли это?",
     "options": ["верно", "неверно"],
     "correct": "верно"},

    {"question": "Иностранный гражданин, не покинувший территорию РФ в установленный срок, подлежит депортации. Верно ли это?",
     "options": ["верно", "неверно"],
     "correct": "верно"},

    {"question": "Иностранный гражданин будет депортирован в случае нарушения срока обращения за патентом. Верно ли это?",
     "options": ["верно", "неверно"],
     "correct": "верно"},

    {"question": "Нарушение правил пересечения государственной границы РФ влечёт наложение административного штрафа. Верно ли это?",
     "options": ["верно", "неверно"],
     "correct": "верно"}
]

option1 = [
    # Listening
    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОни говорят",
     "options": ["в магазине", "в автомастерской", "в центре тестирования"],
     "correct": "в центре тестирования", "audio": "audio/img1_1628676924.ogg"},
    {"question": "Прослушайте объявление и выберите правильный ответ.\n\nСпросите о потерянных вещах",
     "options": ["у покупателей", "у администратора", "у директора магазина"],
     "correct": "у администратора", "audio": "audio/img1_1628677158.ogg"},

    # Reading
    {
        "question": "Прочитайте объявление и выберите правильный ответ.\n\nУважаемые жильцы дома №7!\nЛифт временно не работает!",
        "options": ["в аптеке", "в подъезде", "в парке"], "correct": "в подъезде"},
    {
        "question": "Прочитайте текст и выберите правильный ответ.\n\nДорогой друг!\nПриглашаю тебя на мой День рождения!\nПраздник будет 19 ноября (в четверг) с 15 до 20 часов.\nЖду тебя в кафе «Уют».",
        "options": ["в 15 часов", "в 19 часов", "в 20 часов"], "correct": "в 15 часов"},

    # Writing
    {
        "question": "Прочитайте текст и вставьте пропущенное слово.\n\nДалер приехал из Таджикистана. Далер – кассир.\n\nВпишите нужное слово в анкету.",
        "options": ["кассир", "врач", "учитель"], "correct": "кассир"},

    # Grammar and Vocabulary
    {"question": "Сегодня четверг, а брат приедет завтра, _____________________.",
     "options": ["в среду", "в пятницу", "в субботу"], "correct": "в пятницу"},
    {"question": "В аптеке я купил __________.", "options": ["телефон", "огурцы", "лекарство"], "correct": "лекарство"},
    {"question": "– Как тебя зовут?\n– _______________ зовут Олег.", "options": ["Мне", "Меня", "Я"],
     "correct": "Меня"},
    {"question": "Мы приехали в Россию, __________ найти работу.", "options": ["чтобы", "поэтому", "потому что"],
     "correct": "чтобы"},

    # History
    {"question": "1 января в России празднуют", "options": ["День России", "Новый год", "Международный женский день"],
     "correct": "Новый год"},
    {"question": "Город, который является столицей России - __________.",
     "options": ["Москва", "Екатеринбург", "Самара"], "correct": "Москва"},
    {"question": "Когда закончилась Великая Отечественная война?",
     "options": ["в 1917 году", "в 1945 году", "в 1980 году"], "correct": "в 1945 году"},
    {"question": "СНГ было образовано после",
     "options": ["распада СССР в 1991 году", "Великой Отечественной войны", "Российской революции 1917 года"],
     "correct": "распада СССР в 1991 году"},
    {"question": "Укажите флаг Российской Федерации.",
     "options": ["Белый-синий-красный", "Красный-зеленый-белый", "Синий-белый-золотой"],
     "correct": "Белый-синий-красный"},

    # Law
    {"question": "Что говорит Конституция России о правах иностранцев в России?",
     "options": ["Иностранцы имеют все права и обязанности как граждане России",
                 "Иностранцы имеют права и обязанности, кроме случаев, установленных законом",
                 "Иностранцы не имеют прав в России"],
     "correct": "Иностранцы имеют права и обязанности, кроме случаев, установленных законом"},
    {"question": "Иностранец, работающий в России, должен платить налоги?", "options": ["должен", "не должен", "может"],
     "correct": "должен"},
    {
        "question": "На территории Российской Федерации в отношении иностранного гражданина совершено преступление. Куда он должен обратиться за помощью?",
        "options": ["в полицию", "в МИД", "в посольство своей страны"], "correct": "в полицию"},
    {"question": "Что нужно иметь иностранцу для постановки на учет в России?",
     "options": ["только миграционную карту", "только паспорт", "паспорт и миграционную карту"],
     "correct": "паспорт и миграционную карту"},
    {"question": "Если иностранец нарушил правила учета, какая будет ответственность?",
     "options": ["дисциплинарная", "уголовная", "административная"], "correct": "административная"},
    {"question": "Административное выдворение из России для иностранцев устанавливает судья. Это верно?",
     "options": ["верно", "неверно"], "correct": "верно"}
]

option2 = [
    # Listening
    {"question": "Прослушайте диалог и определите, где они говорят. Выберите правильный ответ.",
     "options": ["в продуктовом магазине", "в кассе кинотеатра", "в магазине «Игрушки»"],
     "correct": "в продуктовом магазине"},
    {"question": "Прослушайте объявление и выберите правильный ответ.",
     "options": ["ехать дальше", "сделать пересадку", "выйти из вагона"], "correct": "сделать пересадку",
     "audio": "audio/var2_1.ogg"},

    # Reading
    {
        "question": "Прочитайте объявление и выберите правильный ответ.\n\nУважаемые пассажиры!\nОплачивайте проезд при входе.",
        "options": ["в кино", "в автобусе", "в магазине"], "correct": "в автобусе"},
    {
        "question": "Прочитайте текст и выберите правильный ответ.\n\nМеня зовут Рушан. Летом я ездил в Узбекистан к родителям. Я увидел своего брата и его семью. А в конце лета я с женой и детьми поехал на море.",
        "options": ["с женой и детьми", "с родителями", "с братом"], "correct": "с женой и детьми",
        "audio": "audio/var2_2.ogg"},

    # Writing
    {
        "question": "Прочитайте текст и вставьте пропущенное слово.\n\nМадина приехала из Узбекистана. Мадина – швея.\n\nВпишите нужное слово в анкету.",
        "options": ["Таджикистана", "России", "Узбекистана"], "correct": "Узбекистана"},

    # Grammar and Vocabulary
    {"question": "В магазине «Продукты» я купил _______________.", "options": ["диван", "куртку", "фрукты"],
     "correct": "фрукты"},
    {"question": "Моя сестра _______________ в больнице.", "options": ["живёт", "гуляет", "работает"],
     "correct": "работает"},
    {"question": "Сколько _______________ лет?", "options": ["Вы", "Вам", "у Вас"], "correct": "Вам"},
    {"question": "Друг спросил меня: «_______________ ты провёл выходные?»", "options": ["Как", "Какой", "Что"],
     "correct": "Как"},

    # History
    {"question": "4 ноября в России празднуют",
     "options": ["Международный женский день", "День народного единства", "День Победы"],
     "correct": "День народного единства"},
    {"question": "Какой из этих городов находится в России?", "options": ["София", "Владивосток", "Берлин"],
     "correct": "Владивосток"},
    {"question": "Союзник СССР в Великой Отечественной войне – это:",
     "options": ["Япония", "Германия", "Великобритания"], "correct": "Великобритания"},
    {"question": "Первый человек, полетевший в космос, был из", "options": ["США", "СССР", "Китая"], "correct": "СССР"},
    {"question": "Укажите флаг Российской Федерации.",
     "options": ["Белый-синий-красный", "Зеленый-белый-синий", "Красный-синий-белый"],
     "correct": "Белый-синий-красный"},

    # Law
    {"question": "Какое право Конституция РФ гарантирует иностранцам?",
     "options": ["голосовать на выборах", "участвовать в суде", "пользоваться родным языком"],
     "correct": "пользоваться родным языком"},
    {"question": "Где регистрируют брак в России?", "options": ["в суде", "в ЗАГСе", "в полиции"],
     "correct": "в ЗАГСе"},
    {"question": "Потеряли паспорт. Куда обратиться?", "options": ["в полицию и консульство", "в суд", "на работу"],
     "correct": "в полицию и консульство"},
    {"question": "Сколько времени дается для постановки на учет в России?",
     "options": ["3 рабочих дня", "7 рабочих дней", "10 рабочих дней"], "correct": "7 рабочих дней"},
    {"question": "Какой кодекс регулирует правила въезда иностранцев в Россию?",
     "options": ["Трудовой кодекс", "Кодекс об административных правонарушениях", "Гражданский кодекс"],
     "correct": "Кодекс об административных правонарушениях"},
    {"question": "Иностранцев с ВИЧ депортируют из России. Это верно?", "options": ["верно", "неверно"],
     "correct": "верно"}
]

option3 = [
    # Listening
    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОни говорят",
     "options": ["на улице", "на остановке", "в автобусе"],
     "correct": "в автобусе", "audio": "audio/img1_1628676913.ogg"},

    {"question": "Прослушайте объявление и выберите правильный ответ.\n\nУ администратора магазина можно",
     "options": ["взять свой потерянный телефон", "купить новый телефон", "позвонить по телефону"],
     "correct": "взять свой потерянный телефон", "audio": "audio/img1_1628677261.ogg"},

    # Reading
    {
        "question": "Прочитайте киноафишу и выберите правильный ответ.\n\nОсенью смотрите фильм о русском музыканте П.И. Чайковском!",
        "options": ["о спорте", "о музыке", "о кино"], "correct": "о музыке"},
    {
        "question": "Прочитайте текст и выберите правильный ответ.\n\nМеня зовут Тимур. Вчера я со своими друзьями ходил на концерт. Концерт был в парке. Нам очень понравилось. После концерта мы решили поужинать в кафе.",
        "options": ["на концерте", "в музее", "в театре"], "correct": "на концерте"},

    # Writing
    {
        "question": "Прочитайте текст и вставьте пропущенное слово.\n\nНариман приехал из Узбекистана. Нариман – врач.\n\nВпишите нужное слово в анкету.",
        "options": ["учитель", "кассир", "врач"], "correct": "врач"},

    # Grammar and Vocabulary
    {"question": "А.С. Пушкин родился летом, _______________.", "options": ["6 июня", "6 апреля", "6 декабря"],
     "correct": "6 июня"},
    {"question": "Мой папа любит _______________ исторические книги.", "options": ["смотреть", "слушать", "читать"],
     "correct": "читать"},
    {"question": "Ты знаешь, _______________ есть брат и сестра?", "options": ["он", "ему", "у него"],
     "correct": "у него"},
    {"question": "Я не могу сегодня пойти на работу, _______________ я заболел.",
     "options": ["чтобы", "потому что", "который"], "correct": "потому что"},

    # History
    {"question": "12 июня в России празднуют",
     "options": ["День России", "Праздник Весны и Труда", "День защитника Отечества"], "correct": "День России"},
    {"question": "Какой город в России называют «второй столицей»?",
     "options": ["Екатеринбург", "Владивосток", "Санкт-Петербург"], "correct": "Санкт-Петербург"},
    {"question": "Противник России в Отечественной войне 1812 года был:",
     "options": ["Швеция", "Великобритания", "Франция"], "correct": "Франция"},
    {"question": "Знаменитый полководец Великой Отечественной войны – это",
     "options": ["А.В. Суворов", "Г.К. Жуков", "Ю.А. Гагарин"], "correct": "Г.К. Жуков"},
    {"question": "Укажите флаг Российской Федерации.",
     "options": ["Белый-синий-красный", "Зеленый-белый-синий", "Красный-синий-белый"],
     "correct": "Белый-синий-красный"},

    # Law
    {"question": "Какое право иностранцу гарантирует Конституция России?",
     "options": ["голосовать на выборах", "выбирать работу", "занимать государственные должности"],
     "correct": "выбирать работу"},
    {"question": "В какой форме заключается трудовой договор в России?",
     "options": ["в письменной", "в устной", "в любой"], "correct": "в письменной"},
    {"question": "Окажут ли срочную медицинскую помощь иностранцу?",
     "options": ["за плату", "бесплатно", "если есть трудовой договор"], "correct": "бесплатно"},
    {"question": "Какую цель нужно указать в миграционной карте для получения патента?",
     "options": ["отдых", "работа", "частная"], "correct": "работа"},
    {"question": "Сколько дней у иностранца для подачи документов на патент?",
     "options": ["30 дней", "20 дней", "10 дней"], "correct": "30 дней"},
    {"question": "Если иностранец не уехал после окончания срока пребывания, он нарушает закон. Это верно?",
     "options": ["верно", "неверно"], "correct": "верно"}
]

option4 = [
    # Listening
    {"question": "Прослушайте диалог и выберите правильный ответ.\n\nЧто сделал Антон?",
     "options": ["Он не дал мобильный телефон.", "Он потерял мобильный телефон.", "Он дал мобильный телефон"],
     "correct": "Он дал мобильный телефон", "audio": "audio/img1_1630321154.ogg"},

    {"question": "Прослушайте объявление и выберите правильный ответ.\n\nВ торговом центре можно пообедать",
     "options": ["на 6 этаже", "на 5 этаже", "на 3 этаже"],
     "correct": "на 5 этаже", "audio": "audio/img1_1700821507.ogg"},

    # Reading
    {
        "question": "Прочитайте объявление и выберите правильный ответ.\n\nСлужебное помещение: вход только для персонала!",
        "options": ["в лифте", "в ресторане", "в автобусе"], "correct": "в ресторане"},
    {
        "question": "Прочитайте текст и выберите правильный ответ.\n\nМеня зовут Динара. Я приехала с родителями из Таджикистана. Мой папа инженер, а мама учительница. В будущем я хочу быть доктором.",
        "options": ["доктором", "учительницей", "инженером"], "correct": "доктором"},

    # Writing
    {
        "question": "Прочитайте текст и вставьте пропущенное слово.\n\nАнвар Рустамов хочет получить работу плотника.\n\nВпишите нужное слово в его заявление.",
        "options": ["плотника", "инженера", "учителя"], "correct": "плотника"},

    # Grammar and Vocabulary
    {"question": "Я с друзьями поеду в горы _____________.", "options": ["зимой", "зимний", "зима"],
     "correct": "зимой"},
    {"question": "Скажите, пожалуйста, ___________ уже закончили?", "options": ["работа", "рабочие", "работать"],
     "correct": "работать"},
    {"question": "– Откуда ты приехал?\n– Я приехал _______________.",
     "options": ["в Самарканде", "из Самарканда", "в Самарканд"], "correct": "из Самарканда"},
    {"question": "Карим сказал, _______________ он приедет в отпуск весной.", "options": ["что", "потому что", "куда"],
     "correct": "что"},

    # History
    {"question": "7 января в России празднуют",
     "options": ["День России", "Международный женский день", "Рождество Христово"], "correct": "Рождество Христово"},
    {"question": "Какой из этих городов российский?", "options": ["Будапешт", "Казань", "Братислава"],
     "correct": "Казань"},
    {"question": "Кто командовал русской армией в войне 1812 года?",
     "options": ["Г.К. Жуков", "Дмитрий Донской", "М.И. Кутузов"], "correct": "М.И. Кутузов"},
    {"question": "Когда было создано СНГ?", "options": ["в 1612 году", "в 1941 году", "в 1991 году"],
     "correct": "в 1991 году"},
    {"question": "Укажите герб Российской Федерации.",
     "options": ["Двуглавый орёл", "Трехцветный щит", "Парусный корабль"], "correct": "Двуглавый орёл"},

    # Law
    {"question": "Что имеет право делать иностранец в России?",
     "options": ["быть пилотом гражданского самолета", "работать на объектах, связанных с безопасностью",
                 "говорить на родном языке"], "correct": "говорить на родном языке"},
    {"question": "Как дети иностранцев учатся в России?",
     "options": ["бесплатно, как и дети граждан России", "только платно", "не имеют права посещать школы и детсады"],
     "correct": "бесплатно, как и дети граждан России"},
    {"question": "Иностранец может жениться в России?", "options": ["да", "да, только на гражданке РФ", "нет"],
     "correct": "да"},
    {"question": "Что нужно получить и заполнить при въезде в Россию?",
     "options": ["заявление на патент", "миграционную карту", "заявление на работу"], "correct": "миграционную карту"},
    {"question": "Какой кодекс регулирует наказание за преступление иностранца в России?",
     "options": ["Уголовный кодекс России", "Уголовный кодекс страны иностранца", "Гражданский кодекс"],
     "correct": "Уголовный кодекс России"},
    {"question": "Иностранец, не уехавший из России вовремя, будет депортирован. Это верно?",
     "options": ["верно", "неверно"], "correct": "верно"}
]

option5 = [
    # Listening
    {
        "question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОбъявление можно услышать",
        "options": ["в ресторане", "в магазине", "в библиотеке"],
        "correct": "в магазине", "audio": "audio/img1_1630321134.ogg"},
    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОни говорят",
     "options": ["в магазине", "в ресторане", "в кафе"],
     "correct": "в магазине", "audio": "audio/img1_1700819917.ogg"},

    # Reading
    {"question": "Прочитайте объявление и выберите правильный ответ.\n\nТехнический перерыв 15 минут",
     "options": ["в магазине", "в самолёте", "в парке"], "correct": "в магазине"},
    {
        "question": "Прочитайте текст и выберите правильный ответ.\n\nСабине сорок три года. Она приехала с семьей из Узбекистана. Дома она работала поваром. Её муж работает таксистом. Сабина планирует работать в школе поваром.",
        "options": ["таксистом", "поваром", "продавцом"], "correct": "поваром"},

    # Writing
    {
        "question": "Прочитайте текст и вставьте пропущенное слово.\n\nКарим Исмаилов хочет получить работу повара.\n\nВпишите нужное слово в его заявление.",
        "options": ["повара", "водителя", "учителя"], "correct": "повара"},

    # Grammar and Vocabulary
    {"question": "– Автобусная остановка находится здесь?\n– Нет, ___________________.",
     "options": ["там", "оттуда", "куда"], "correct": "там"},
    {"question": "Мой брат работает в ресторане _____________________.",
     "options": ["учителем", "курьером", "инженером"], "correct": "курьером"},
    {"question": "Извините, это ________ телефон?", "options": ["Ваша", "Ваши", "Ваш"], "correct": "Ваш"},
    {"question": "Скажите, пожалуйста, _________ находится аптека?", "options": ["где", "как", "откуда"],
     "correct": "где"},

    # History
    {"question": "23 февраля в России празднуют",
     "options": ["Праздник Весны и Труда", "День защитника Отечества", "День России"],
     "correct": "День защитника Отечества"},
    {"question": "Какой из этих городов в России?", "options": ["София", "Прага", "Новосибирск"],
     "correct": "Новосибирск"},
    {"question": "Когда началась Великая Отечественная война?",
     "options": ["в 1812 году", "в 1917 году", "в 1941 году"], "correct": "в 1941 году"},
    {"question": "Кто участвовал в создании СНГ?", "options": ["Иван Грозный", "Борис Ельцин", "Дмитрий Пожарский"],
     "correct": "Борис Ельцин"},
    {"question": "Укажите герб Российской Федерации.",
     "options": ["Двуглавый орёл", "Трехцветный щит", "Парусный корабль"], "correct": "Двуглавый орёл"},

    # Law
    {"question": "Какое право гарантирует Конституция РФ иностранцу?",
     "options": ["ознакомиться с документами, касающимися его прав", "самостоятельно составлять документы",
                 "вносить изменения в документы"], "correct": "ознакомиться с документами, касающимися его прав"},
    {"question": "Может ли иностранец купить недвижимость в России?",
     "options": ["может", "не может", "только с разрешения суда"], "correct": "может"},
    {"question": "Куда обратиться, если ограбили?", "options": ["в полицию", "в суд", "на работу"],
     "correct": "в полицию"},
    {"question": "Если срок пребывания в России сокращен, за сколько дней нужно покинуть страну?",
     "options": ["90 дней", "30 дней", "3 дня"], "correct": "3 дня"},
    {"question": "Если иностранец нарушил правила учета, какую ответственность он понесет?",
     "options": ["дисциплинарную", "уголовную", "административную"], "correct": "административную"},
    {"question": "Если иностранец вовремя не подал на патент, его депортируют. Это верно?",
     "options": ["верно", "неверно"], "correct": "верно"}
]

