
questions = [
    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОни говорят",
     "options": ["в магазине", "в автомастерской", "в центре тестирования"],
     "correct": "в центре тестирования", "audio": "audio/img1_1628676924.ogg"},

    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОни говорят",
     "options": ["на улице", "на остановке", "в автобусе"],
     "correct": "в автобусе", "audio": "audio/img1_1628676913.ogg"},

    {"question": "Прослушайте диалог и определите, где происходит разговор.  Выберите правильный ответ.\n\nОни говорят",
     "options": ["в кинотеатре", "в магазине", "в гостинице"],
     "correct": "в гостинице", "audio": "audio/img1_1628676900.ogg"},

    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОбъявление можно услышать",
     "options": ["в ресторане", "в магазине", "в библиотеке"],
     "correct": "в магазине", "audio": "audio/img1_1630321134.ogg"},

    {"question": "Прослушайте диалог и определите, где происходит разговор. Выберите правильный ответ.\n\nОни говорят",
     "options": ["в магазине", "в ресторане", "в кафе"],
     "correct": "в магазине", "audio": "audio/img1_1700819917.ogg"},

    {"question": "Прослушайте объявление и выберите правильный ответ.\n\nСпросите о потерянных вещах",
     "options": ["у покупателей", "у администратора", "у директора магазина"],
     "correct": "у администратора", "audio": "audio/img1_1628677158.ogg"},

    {"question": "Прослушайте объявление и выберите правильный ответ.\n\nУ администратора магазина можно",
     "options": ["взять свой потерянный телефон", "купить новый телефон", "позвонить по телефону"],
     "correct": "взять свой потерянный телефон", "audio": "audio/img1_1628677261.ogg"},

    {"question": "Прослушайте объявление и выберите правильный ответ.\n\nТеперь банк будет работать",
     "options": ["до 9 часов вечера", "как обычно", "до 21 мая"],
     "correct": "до 9 часов вечера", "audio": "audio/img1_1628677287.ogg"},

    {"question": "Прослушайте диалог и выберите правильный ответ.\n\nЧто сделал Антон?",
     "options": ["Он не дал мобильный телефон.", "Он потерял мобильный телефон.", "Он дал мобильный телефон"],
     "correct": "Он дал мобильный телефон", "audio": "audio/img1_1630321154.ogg"},

    {"question": "Прослушайте объявление и выберите правильный ответ.\n\nВ торговом центре можно пообедать",
     "options": ["на 6 этаже", "на 5 этаже", "на 3 этаже"],
     "correct": "на 5 этаже", "audio": "audio/img1_1700821507.ogg"}
]
